Revit 2027 API
PipePressureDropData.FlowState Property
 The flowState of the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeFlowState FlowState { get; set; }
Public Property FlowState As PipeFlowState
	Get
	Set
public:
property PipeFlowState FlowState {
	PipeFlowState get ();
	void set (PipeFlowState value);
}
member FlowState : PipeFlowState with get, set
Property Value
PipeFlowState
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace